andy840119/ULANI-ESP32/sdkconfig.defaults
# ---- target ----
CONFIG_IDF_TARGET="esp32c3"

# ---- partition table ----
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- Bluetooth: NimBLE, central role only ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
# Counter-intuitive but required: NimBLE dispatches *incoming* notifications
# through the ATT server (ble_att_svr_rx_notify), so a central that turns the
# peripheral role off silently loses the ability to receive them. The panel
# notifies and the frames are simply discarded below the GAP layer -- no error,
# no event, every op just times out.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# 230-byte writes need ATT MTU >= 233; ask for the max we can get.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120

# ---- WiFi: SoftAP only for now ----
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# ---- HTTP server ----
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Phones open several keep-alive connections at once and the UI polls on a
# timer, so the default of 10 sockets runs out and accept() starts failing with
# ENFILE. Leave headroom above whatever max_open_sockets web_server asks for.
CONFIG_LWIP_MAX_SOCKETS=16

# ---- misc ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
